export default function ViewSourceEgg() {
  const asciiComment = `
<!--

██╗░░██╗███████╗██╗░░░██╗  ██╗░░░██╗░█████╗░██╗░░░██╗██╗
██║░░██║██╔════╝╚██╗░██╔╝  ╚██╗░██╔╝██╔══██╗██║░░░██║██║
███████║█████╗░░░╚████╔╝░  ░╚████╔╝░██║░░██║██║░░░██║██║
██╔══██║██╔══╝░░░░╚██╔╝░░  ░░╚██╔╝░░██║░░██║██║░░░██║╚═╝
██║░░██║███████╗░░░██║░░░  ░░░██║░░░╚█████╔╝╚██████╔╝██╗
╚═╝░░╚═╝╚══════╝░░░╚═╝░░░  ░░░╚═╝░░░░╚════╝░░╚═════╝░╚═╝

👀

Yeah you, snooping around in here.

There's nothing for you.

Go away.

...

Still here? Weird.

-->
`;

  return (
    <span
      suppressHydrationWarning
      dangerouslySetInnerHTML={{ __html: asciiComment }}
    />
  );
}
